
var credit = {

	//更新时间
	update: "2013-08-01",

	//姓名列表
	name: ["阳团", "夏国英", "陈诚", "夏德雄", "潘磊", "钟思" ],

	//详细数据
	data: {

		//初级前端开发工程师
		"primary": {

			//前期阶段
			"one": {

				//对Web前端开发工程师一职要有较为深入的认识和了解。
				"1": {

					"total": 2,
					"阳团": 2,
					"夏国英": 2,
					"陈诚": 2,
					"夏德雄": 2,
					"潘磊": 2,
					"钟思": 2
				},

				//能够独立完成基本的页面布局。
				"2": {

					"total": 3,
					"阳团": 3,
					"夏国英": 3,
					"陈诚": 3,
					"夏德雄": 3,
					"潘磊": 3,
					"钟思": 3
				},

				//知道如何处理浏览器之间的兼容性问题。
				"3": {

					"total": 3,
					"阳团": 3,
					"夏国英": 3,
					"陈诚": 3,
					"夏德雄": 3,
					"潘磊": 3,
					"钟思": 3
				},

				//了解JavaScript的基本语法和语句。
				"4": {

					"total": 2,
					"阳团": 2,
					"夏国英": 2,
					"陈诚": 2,
					"夏德雄": 2,
					"潘磊": 2,
					"钟思": 2
				}
			},

			//中期阶段
			"two": {

				//对W3C标准和HTML标签的语义化有较为深入的理解。
				"1": {

					"total": 2,
					"阳团": 2,
					"夏国英": 2,
					"陈诚": 2,
					"夏德雄": 2,
					"潘磊": 2,
					"钟思": 2
				},

				//能够快速地进行页面的布局。
				"2": {

					"total": 2,
					"阳团": 2,
					"夏国英": 2,
					"陈诚": 2,
					"夏德雄": 2,
					"潘磊": 2,
					"钟思": 2
				},

				//能够快速地进行浏览器的兼容性处理。
				"3": {

					"total": 2,
					"阳团": 2,
					"夏国英": 2,
					"陈诚": 2,
					"夏德雄": 2,
					"潘磊": 2,
					"钟思": 2
				},

				//对HTML5和CSS3有一个较为全面的认识和了解。
				"4": {

					"total": 4,
					"阳团": 1,
					"夏国英": 1,
					"陈诚": 0,
					"夏德雄": 2,
					"潘磊": 0,
					"钟思": 0
				}
			},

			//后期阶段
			"three": {

				//对JavaScript有一个较为全面的认识和理解。
				"1": {

					"total": 5,
					"阳团": 5,
					"夏国英": 2,
					"陈诚": 2,
					"夏德雄": 0,
					"潘磊": 2,
					"钟思": 0
				},

				//了解网站前端展现与数据的交互过程。
				"2": {

					"total": 5,
					"阳团": 5,
					"夏国英": 5,
					"陈诚": 3,
					"夏德雄": 0,
					"潘磊": 1,
					"钟思": 0
				}
			}
		},

		//中级前端开发工程师
		"middle": {

			//前期阶段
			"one": {

				//熟悉各种类型的页面布局结构，并能快速地将其实现为符合标准的、高可扩展性的、高可访问性的、高性能的Web页面。
				"1": {

					"total": 2,
					"阳团": 1,
					"夏国英": 1,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟练掌握移动设备端的Web开发。
				"2": {

					"total": 3,
					"阳团": 1,
					"夏国英": 1,
					"陈诚": 0,
					"夏德雄": 1,
					"潘磊": 0,
					"钟思": 0
				},

				//熟练掌握基于HTML5和CSS3的Web开发。
				"3": {

					"total": 3,
					"阳团": 1,
					"夏国英": 1,
					"陈诚": 0,
					"夏德雄": 1,
					"潘磊": 0,
					"钟思": 0
				},

				//对SEO（搜索引擎优化）、SEF（搜索引擎友好）有较为深入的研究与应用。
				"4": {

					"total": 2,
					"阳团": 1,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				}
			},

			//中期阶段
			"two": {

				//熟练运用各类开发工具和辅助插件。
				"1": {

					"total": 3,
					"阳团": 1,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//对JavaScript有一个较为深入的理解和认识。
				"2": {

					"total": 5,
					"阳团": 0,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				}
			},

			//后期阶段
			"three": {

				//对视觉设计、用户体验、交互设计具有较为深入的理解和认知。
				"1": {

					"total": 8,
					"阳团": 0,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//对网站数据分析有一定的研究和实战经验。
				"2": {

					"total": 4,
					"阳团": 1,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				}
			}
		},

		//高级前端开发工程师
		"advanced": {

			//前期阶段
			"one": {

				//至少熟悉并掌握一门后端编程语言（如：ASP.NET+Sql Server、PHP+MySQL）。
				"1": {

					"total": 20,
					"阳团": 5,
					"夏国英": 3,
					"陈诚": 8,
					"夏德雄": 1,
					"潘磊": 3,
					"钟思": 0
				}
			},

			//中期阶段
			"two": {

				//至少3年的前端开发工作经验。
				"1": {

					"total": 2,
					"阳团": 0,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//具备多年的JavaScript开发实战经验。
				"2": {

					"total": 4,
					"阳团": 0,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//具备后端项目的开发实战经验。
				"3": {

					"total": 4,
					"阳团": 0,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				}
			},

			//后期阶段
			"three": {

				//具备服务器管理经验。
				"1": {

					"total": 8,
					"阳团": 3,
					"夏国英": 1,
					"陈诚": 1,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//对网站安全具有一定的研究和实践经验。
				"2": {

					"total": 12,
					"阳团": 0,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				}
			}
		},

		//业务学分
		"business": {

			"one": {

				//负责相关项目的日常维护工作；
				"1": {

					"total": 10,
					"阳团": 10,
					"夏国英": 10,
					"陈诚": 10,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟悉项目程序的整体框架，可对项目网站的结构及性能做相关优化操作；
				"2": {

					"total": 4,
					"阳团": 4,
					"夏国英": 3,
					"陈诚": 2,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//负责服务器和域名的维护管理工作；
				"3": {

					"total": 2,
					"阳团": 2,
					"夏国英": 1,
					"陈诚": 1,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟练掌握JavaScript编程技术，共同参与网站JS开发库的编写和优化工作；
				"4": {

					"total": 2,
					"阳团": 2,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//负责各项目程序、共享资源的日常维护和备份工作；
				"5": {

					"total": 1,
					"阳团": 1,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟悉小组工作规范的整体流程，并参与规范的制定、优化和推广工作；
				"6": {

					"total": 2,
					"阳团": 2,
					"夏国英": 1,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟悉广告管家的工作模式和使用方式，并为广告管家提供高性能、高可用性、高易用性的物料模板；
				"7": {

					"total": 2,
					"阳团": 2,
					"夏国英": 1,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟悉CDN的工作模式并负责网站CDN产品的部署与维护；
				"8": {

					"total": 2,
					"阳团": 2,
					"夏国英": 1,
					"陈诚": 1,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟悉统计代码的工作模式并负责网站统计代码的部署与维护；
				"9": {

					"total": 2,
					"阳团": 2,
					"夏国英": 1,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				},

				//熟悉网站商务通的工作模式，并负责商务通相关的管理、维护和优化操作；
				"10": {

					"total": 3,
					"阳团": 2,
					"夏国英": 0,
					"陈诚": 0,
					"夏德雄": 0,
					"潘磊": 0,
					"钟思": 0
				}
			}
		},

		//其他学分
		"other": {

			//英语水平
			"english": {

				"1": {

					"total": 6,
					"阳团": 2,
					"夏国英": 2,
					"陈诚": 2,
					"夏德雄": 2,
					"潘磊": 2,
					"钟思": 2
				}
			},

			//工作年限
			"year": {

				"1": {

					"total": 8,
					"阳团": 4,
					"夏国英": 4,
					"陈诚": 4,
					"夏德雄": 6,
					"潘磊": 0,
					"钟思": 0
				}
			},

			//学历
			"education": {

				"1": {

					"total": 6,
					"阳团": 2,
					"夏国英": 2,
					"陈诚": 4,
					"夏德雄": 2,
					"潘磊": 2,
					"钟思": 2
				}
			}
		}
	}
};